Tekla.Structures.ModelInternal.Dstv.DstvWeldingPreparation
The dstv weld preparation information.

Tekla.Structures.ModelInternal.Dstv.DstvWeldingPreparation.Angle
The angle.

Tekla.Structures.ModelInternal.Dstv.DstvWeldingPreparation.Offset
The offset.